# Задача 34: Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам
# стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного
# слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг от друга пробелами. Стихотворение Винни-Пух вбивает в программу с клавиатуры. В ответе
# напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке/       Ввод:пара-ра-рам рум-пум-попом па-ра-па-дум     Вывод:Парам пам-пам

import os  
def cls():
    os.system('cls' if os.name == 'nt' else 'clear')
cls()



def is_glasn(letter):
    glasn = {'а','е','и','у','о','ы','ё','э','я','ю'}#множество
    if letter in glasn:
        return True
    return False

print('Введите стих. Слова во фразе разделяются дефисами, фразы разделяются пробелами: ')
stih = input().split()
# print(stih)
print('Это стих?')
phrase_length = [list(filter(is_glasn, phrase)) for phrase in stih]#удаление согласных
# print(phrase_length)
is_stih = True
for i in range(len(phrase_length)-1):
    if len(phrase_length[i])!=len(phrase_length[i+1]):
        print('Пам парам (нет)')
        is_stih = False
        break
if is_stih:
    print('Парам пам-пам (да)')