# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. Определите минимальное число
# монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. Выведите минимальное
# количество монет, которые нужно перевернуть.

import os  
def cls():
    os.system('cls' if os.name == 'nt' else 'clear')
cls()

number = int(input('Введите количество монет: '))
count = number
orel = 0
while count > 0:
    orel+= int(input('Введите 0 (решка) или 1 (орел): '))
    count-=1
reshka = number - orel 
if reshka < orel:
    print(f'Нужно перевернуть {reshka} монет')
else:
    print(f'Нужно перевернуть {orel} монет')
