# Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. Из всех арифметических операций допускаются только +1 и -1.
# Также нельзя использовать циклы.

def sum_of_two (a, b):
    if b == 0:
        return a
    return sum_of_two(a + 1, b - 1)

num1 = int(input("Введите первое число: "))
num2 = int(input("Введите второе число: "))
print(sum_of_two(num1, num2))