# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). Выдать без повторений в порядке возрастания все те числа, которые
# встречаются в обоих наборах. Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во
# элементов второго множества. Затем пользователь вводит сами элементы множеств.

import os  
def cls():
    os.system('cls' if os.name == 'nt' else 'clear')
cls()

n = int(input('Введите элементов первого набора: '))
m = int(input('Введите элементов второго набора: '))
nabor1 = [0]*n
nabor2 = [0]*m
for i in range (0,n):
    nabor1[i] = int(input(f'введите элемент первого набора № {i+1}: '))
for i in range (0,m):
    nabor2[i] = int(input(f'введите элемент второго набора № {i+1}: '))
nabor1 = set(nabor1)
nabor2 = set(nabor2)
result = list(nabor1.intersection(nabor2))
print(sorted(result))