# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали N журавликов. Сколько журавликов сделал каждый
# ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

import os  
def cls():
    os.system('cls' if os.name == 'nt' else 'clear')
cls()

number = int(input('Введите число журавликов: '))
number = number//6*6 #приведение числа журавликов к ближайшему, которое удовлетворяет условиям задачи
print (f'Всего сделано {number} журавликов. Петя и Сережа сделали по {number//6} журавликов, а Катя сделала {number*2//3} журавликов.')