# Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если разрешается сделать один разлом по
# прямой между дольками (то есть разломить шоколадку на два прямоугольника).
# это значит, что количество долек должно делиться на n или m без остатка и частное д.б. >= 1,
# а количество отламываемых долек должно быть меньше общего количества долек

import os  
def cls():
    os.system('cls' if os.name == 'nt' else 'clear')
cls()

print('Введите размер шоколадки.')
m = int(input('Введите количество долек по горизонтали: '))
n = int(input('Введите количество долек по вертикали: '))
k = int(input('Какое количество долек хотите отломить? '))
if (k % m == 0 or k % n == 0) and k != 0 and k < m * n:
    print('Отломить столько возможно')
else:
    print('Отломить столько невозможно!')