# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. Он задумывает два
# натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их
# произведение P. Помогите Кате отгадать задуманные Петей числа. 4 4 -> 2 2, 5 6 -> 2 3

import os  
def cls():
    os.system('cls' if os.name == 'nt' else 'clear')
cls()

S = int(input('Введите сумму чисел: '))
P = int(input('Введите произведение чисел: '))
find = False
for i in range (1001):
    if find == False:  #условие для выхода из внешнего цикла, когда результат найден
        for j in range (1001):
            if i+j == S and i*j == P:
                print (f'Найдены числа {i} и {j}')
                find = True
                break
    else:
        break
if find == False:
    print('Таких чисел нет')        